app/controllers/convenios_controller.rb

  def index
    @convenios = Convenio.all
---
SELECT `convenios`.* FROM `convenios`

  def create
    @convenio = Convenio.new(convenio_params)

    respond_to do |format|
      if @convenio.save
---
INSERT INTO `convenios` (`created_at`, `nome`, `site`, `tipo`, `updated_at`) VALUES ('2014-09-19 03:17:41', 'Unimed', '', 'Pacote', '2014-09-19 03:17:41')

    def set_convenio
      @convenio = Convenio.find(params[:id])
---
SELECT `convenios`.* FROM `convenios` WHERE `convenios`.`id` = 1 LIMIT 1