app/controllers/pacientes_controller.rb

SELECT `pacientes`.* FROM `pacientes`
---
  def index
    @pacientes = Paciente.all

INSERT INTO `pacientes` (`altura`, `carteiranumero`, `created_at`, `idade`, `iskid`, `nome`, `peso`, `updated_at`) VALUES (180.0, '101', '2014-10-26 23:17:16', '2009-10-26', 0, 'Gustavo Vasconcelos', 94.0, '2014-10-26 23:17:16')
---
  def create
    @paciente = Paciente.new(paciente_params)

    respond_to do |format|
      if @paciente.save

SELECT `pacientes`.* FROM `pacientes` WHERE `pacientes`.`id` = 1 LIMIT 1
---
    def set_paciente
      @paciente = Paciente.find(params[:id])