app/controllers/prescricaones_controller.rb

SELECT `etapanes`.* FROM `etapanes` WHERE `etapanes`.`prescricaone_id` IN (2, 3)
SELECT `prescricaones`.* FROM `prescricaones`
---
  def index
    @prescricaones = Prescricaone.includes(:etapanes).all

INSERT INTO `prescricaones` (`created_at`, `data`, `nutricionista`, `updated_at`) VALUES ('2015-01-23 04:45:21', '2015-01-23', '', '2015-01-23 04:45:21')
---
  def create
    @prescricaone = Prescricaone.new(prescricaone_params)

    respond_to do |format|
      if @prescricaone.save

DELETE FROM `prescricaones` WHERE `prescricaones`.`id` = 2
---
  def destroy
    @prescricaone.destroy

SELECT `prescricaones`.* FROM `prescricaones` WHERE `prescricaones`.`id` = 2 LIMIT 1
---
    def set_prescricaone
      @prescricaone = Prescricaone.find(params[:id])