app/controllers/produtos_controller.rb

SELECT `produtos`.* FROM `produtos`
---
  def index
    @produtos = Produto.all